compenguy/tempy/sdkconfig.defaults.esp32h2
CONFIG_IDF_TARGET="esp32h2"

# Enable BLE sleep
CONFIG_BT_LE_SLEEP_ENABLE=y
CONFIG_BT_LE_LP_CLK_SRC_MAIN_XTAL=y
CONFIG_RTC_CLK_SRC_EXT_CRYS=n

# Power Management
CONFIG_ESP_SLEEP_POWER_DOWN_FLASH=y
CONFIG_PM_ENABLE=y
CONFIG_PM_DFS_INIT_AUTO=y
CONFIG_PM_POWER_DOWN_PERIPHERAL_IN_LIGHT_SLEEP=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_48=y

# FreeRTOS config for light sleep
CONFIG_FREERTOS_HZ=1000
CONFIG_FREERTOS_ENABLE_BACKWARD_COMPATIBILITY=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y

# IEEE802.15.4 sleep
CONFIG_IEEE802154_SLEEP_ENABLE=y

# Enable OpenThread
CONFIG_OPENTHREAD_ENABLED=y
CONFIG_OPENTHREAD_SRP_CLIENT=y
CONFIG_OPENTHREAD_LOG_LEVEL_DYNAMIC=n
CONFIG_OPENTHREAD_LOG_LEVEL_NOTE=y
CONFIG_OPENTHREAD_CLI=n
CONFIG_OPENTHREAD_MTD=y

# mbedTLS
CONFIG_MBEDTLS_SSL_PROTO_DTLS=y

# LwIP config for OpenThread for light sleep
CONFIG_LWIP_IPV6_NUM_ADDRESSES=8
CONFIG_LWIP_MULTICAST_PING=y
CONFIG_LWIP_IPV4=n
CONFIG_LWIP_ND6=n
CONFIG_DISABLE_IPV4=y

# MDNS platform
CONFIG_USE_MINIMAL_MDNS=n

# Disable STA for ESP32H2
CONFIG_ENABLE_WIFI_STATION=n

# Matter configuration
CONFIG_ENABLE_OTA_REQUESTOR=y
CONFIG_ENABLE_EXTENDED_DISCOVERY=y

# ICD configuration
CONFIG_ENABLE_ICD_SERVER=y

# Slow poll: How often device checks Thread network when idle.
# Increased to 60s to match sensor reading interval - major power savings.
CONFIG_ICD_SLOW_POLL_INTERVAL_MS=60000

# Fast poll: How often device polls when active (commissioning, recent activity).
# 200ms provides responsive commissioning without excessive polling.
CONFIG_ICD_FAST_POLL_INTERVAL_MS=200

# Idle mode interval: Time before transitioning from active to idle mode.
# Reduced to 30s - device goes idle faster after activity completes.
CONFIG_ICD_IDLE_MODE_INTERVAL_SEC=30

# Active mode interval: How long device stays awake after sending a message.
# Reduced to 500ms - enough for response, then back to sleep.
CONFIG_ICD_ACTIVE_MODE_INTERVAL_MS=500

# Active mode threshold: Minimum active time when woken by external event.
# Reduced to 1s - quick wake, handle event, return to idle.
CONFIG_ICD_ACTIVE_MODE_THRESHOLD_MS=1000

# LIT (Long Idle Time) ICD - enables deep idle states
CONFIG_ENABLE_ICD_LIT=y

# Subscription limits - 2 is sufficient for most home automation setups
CONFIG_ICD_CLIENTS_SUPPORTED_PER_FABRIC=2
CONFIG_ICD_MAX_NOTIFICATION_SUBSCRIBERS=2

# Enable power save for the button
CONFIG_GPIO_BUTTON_SUPPORT_POWER_SAVE=y

# ESP32-H2-DevKitM-1 Settings
# Buttons
CONFIG_BSP_BUTTONS_NUM=1
CONFIG_BSP_BUTTON_1_TYPE_GPIO=y
CONFIG_BSP_BUTTON_1_GPIO=9
CONFIG_BSP_BUTTON_1_LEVEL=0
